# IMDB: What Makes Successful Movies?

## Import Packages

In [229]:
## Pandas
import pandas as pd
## Numpy
import numpy as np

## Load Data

In [230]:
## Load Data from three specific files

# title.basics.tsv.gz
basics_url = "https://datasets.imdbws.com/title.basics.tsv.gz"
basics = pd.read_csv(basics_url, sep='\t', low_memory=False)

# title.ratings.tsv.gz
ratings_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"
ratings = pd.read_csv(ratings_url, sep='\t', low_memory=False)

# title.akas.tsv.gz
akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"
akas = pd.read_csv(akas_url, sep='\t', low_memory=False)

In [231]:
# Save Data copy to local disk
basics.to_csv('Data/basics.csv.gz', compression = 'gzip', index=False)
ratings.to_csv('Data/ratings.csv.gz', compression = 'gzip', index=False)
akas.to_csv('Data/akas.csv.gz', compression = 'gzip', index=False)

In [232]:
# Use files from local disk now, instead
basics = pd.read_csv("Data/basics.csv.gz", low_memory = False)
ratings = pd.read_csv("Data/ratings.csv.gz", low_memory = False)
akas = pd.read_csv("Data/akas.csv.gz", low_memory = False)

In [233]:
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"

In [234]:
ratings.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1983
1  tt0000002            5.8       265
2  tt0000003            6.5      1839

In [235]:
akas.head(3)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0

In [236]:
basics_copy = basics

In [237]:
ratings_copy = ratings

In [238]:
akas_copy = akas

In [239]:
# Restore original copy of data due to error in processing
ratings = ratings_copy
akas = akas_copy

In [240]:
# Restore original copy of data due to error in processing
basics = basics_copy

## Data Cleaning

### Remove '\N' values

'\N' is the null value used that needs to be removed.

#### akas df

In [241]:
akas['language'].value_counts()

\N    6653810
ja    4225929
fr    4196752
hi    4163775
es    4132689
       ...
sq          1
jv          1
su          1
rm          1
cr          1
Name: language, Length: 108, dtype: int64

In [242]:
# see if a working filter can be found for '\N'
filter_akas = akas == '\\N'
filter_akas

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,False,False,False,False,True,False,True,False
1,False,False,False,False,True,True,False,False
2,False,False,False,False,True,False,True,False
3,False,False,False,False,True,False,True,False
4,False,False,False,False,True,False,True,False
...,...,...,...,...,...,...,...,...
36425028,False,False,False,False,False,True,True,False
36425029,False,False,False,False,False,True,True,False
36425030,False,False,False,False,False,True,True,False
36425031,False,False,False,False,True,False,True,False
36425032,False,False,False,True,True,False,True,False

In [243]:
# count the number of '\N' values (returned as 'True') in df
filter_akas.apply(pd.Series.value_counts)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
False,36425033.0,36425033.0,36425033.0,34529923,29771223,5598462,261989,36422955
True,NaN,NaN,NaN,1895110,6653810,30826571,36163044,2078

In [244]:
# replace all '\N' values with NaN
akas = akas.replace({'\\N':np.nan})

In [245]:
# Verify that all '\N' values have been replace with Nan: no 'True' values
filter_akas.apply(pd.Series.value_counts)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
False,36425033.0,36425033.0,36425033.0,34529923,29771223,5598462,261989,36422955
True,NaN,NaN,NaN,1895110,6653810,30826571,36163044,2078

In [246]:
# Create updated df filter to see if any '\N' values remain
filter_akas_nan = akas == '\\N'
filter_akas_nan

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
36425028,False,False,False,False,False,False,False,False
36425029,False,False,False,False,False,False,False,False
36425030,False,False,False,False,False,False,False,False
36425031,False,False,False,False,False,False,False,False
36425032,False,False,False,False,False,False,False,False

In [247]:
# count the number of '\N' values (returned as 'True') in df
filter_akas_nan.apply(pd.Series.value_counts)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
False,36425033,36425033,36425033,36425033,36425033,36425033,36425033,36425033

All '\N' values in 'akas' df have been removed.

Repeat for 'ratings' and 'basics'

#### ratings df

In [248]:
# see if a working filter can be found for '\N'
filter_ratings = ratings == '\\N'

# count the number of '\N' values (returned as 'True') in df
filter_ratings.apply(pd.Series.value_counts)

        tconst  averageRating  numVotes
False  1325919        1325919   1325919

No '\N' values found in 'ratings' df

#### basics df

In [249]:
# see if a working filter can be found for '\N'
filter_basics = basics == '\\N'

# count the number of '\N' values (returned as 'True') in df
filter_basics.apply(pd.Series.value_counts)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
False,9974457.0,9974457.0,9974457.0,9974457.0,9974456,8629813,109386,2954807,9526486
True,NaN,NaN,NaN,NaN,1,1344644,9865071,7019650,447971

In [250]:
# replace all '\N' values with NaN
basics = basics.replace({'\\N':np.nan})

# Verify that all '\N' values have been replace with Nan: no 'True' values
filter_basics.apply(pd.Series.value_counts)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
False,9974457.0,9974457.0,9974457.0,9974457.0,9974456,8629813,109386,2954807,9526486
True,NaN,NaN,NaN,NaN,1,1344644,9865071,7019650,447971

In [251]:
# Create updated df filter to see if any '\N' values remain
filter_basics_nan = basics == '\\N'

# count the number of '\N' values (returned as 'True') in df
filter_basics_nan.apply(pd.Series.value_counts)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
False,9974457,9974457,9974457,9974457,9974457,9974457,9974457,9974457,9974457

All '\N' values in 'basics' df have been removed.

All three dfs have been updated.

### Remove Movies w/ null runtimeMinutes

in basics df

In [252]:
# Count number of movies with a null value for 'runtimeMinutes' column
basics['runtimeMinutes'].isna().sum()

7019650

In [253]:
# Remove all movies with null values for 'runtimeMinutes'
basics.dropna(subset = ['runtimeMinutes'], inplace = True)

In [254]:
# Verify movies with a null value for 'runtimeMinutes' have been removed
basics['runtimeMinutes'].isna().sum()

0

All null values removed from 'runtimeMinutes'

### Remove Movies w/ null genre

in basics df

In [255]:
# Count number of movies with a null value for 'genres' column
basics['genres'].isna().sum()

76802

In [256]:
# Remove all movies with null values for 'genres'
basics.dropna(subset = ['genres'], inplace = True)

In [257]:
# Verify movies with a null value for 'genres' have been removed
basics['genres'].isna().sum()

0

All null values removed from 'genres'

### Remove non Movies

in basics df

In [258]:
# Check current values for 'titleType'
basics['titleType'].value_counts()

tvEpisode       1477481
short            605932
movie            384628
video            181787
tvMovie           92186
tvSeries          91134
tvSpecial         18433
tvMiniSeries      17406
tvShort            8694
videoGame           324
Name: titleType, dtype: int64

In [259]:
# Keep only movies
basics = basics.loc[basics['titleType'] == 'movie']
basics.titleType.value_counts()

movie    384628
Name: titleType, dtype: int64

Only movie titleType values remain

### Remove Movies outside of 2000-2022

in basics df

In [260]:
# Check current values for 'startYear'
basics['startYear'].value_counts()

2017    14390
2018    14361
2019    14114
2016    13979
2015    13488
        ...
1899        1
1904        1
1897        1
1896        1
1894        1
Name: startYear, Length: 130, dtype: int64

In [261]:
basics.startYear.info()

<class 'pandas.core.series.Series'>
Int64Index: 384628 entries, 8 to 9974407
Series name: startYear
Non-Null Count   Dtype
--------------   -----
378108 non-null  object
dtypes: object(1)
memory usage: 5.9+ MB

In [262]:
# Need to remove NaN values in order to coerce to value type integer
basics = basics.dropna(subset = ['startYear'])

In [263]:
basics.startYear = basics.startYear.astype(int)
basics.startYear.info()

<class 'pandas.core.series.Series'>
Int64Index: 378108 entries, 8 to 9974407
Series name: startYear
Non-Null Count   Dtype
--------------   -----
378108 non-null  int64
dtypes: int64(1)
memory usage: 5.8 MB

In [264]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 378108 entries, 8 to 9974407
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          378108 non-null  object
 1   titleType       378108 non-null  object
 2   primaryTitle    378108 non-null  object
 3   originalTitle   378108 non-null  object
 4   isAdult         378108 non-null  object
 5   startYear       378108 non-null  int64
 6   endYear         0 non-null       object
 7   runtimeMinutes  378108 non-null  object
 8   genres          378108 non-null  object
dtypes: int64(1), object(8)
memory usage: 28.8+ MB

In [265]:
# Keep only startYear values that include 2000 - 2022
basics = basics[(basics['startYear'] >= 2000) & (basics['startYear'] <= 2022)]
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 223933 entries, 13082 to 9974407
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          223933 non-null  object
 1   titleType       223933 non-null  object
 2   primaryTitle    223933 non-null  object
 3   originalTitle   223933 non-null  object
 4   isAdult         223933 non-null  object
 5   startYear       223933 non-null  int64
 6   endYear         0 non-null       object
 7   runtimeMinutes  223933 non-null  object
 8   genres          223933 non-null  object
dtypes: int64(1), object(8)
memory usage: 17.1+ MB

In [266]:
basics.startYear.value_counts()

2017    14390
2018    14361
2019    14114
2016    13979
2015    13488
2014    13129
2022    12976
2021    12437
2013    12402
2012    11657
2020    11604
2011    10787
2010    10217
2009     9375
2008     8165
2007     6974
2006     6532
2005     5853
2004     5219
2003     4603
2002     4140
2001     3881
2000     3650
Name: startYear, dtype: int64

Only movies from startYear 2000 through 2022 remain.

### Remove Documentary Movies

in basics df

In [267]:
# View values for 'genres'
basics.genres.value_counts()

Documentary                  53453
Drama                        36110
Comedy                       13476
Comedy,Drama                  6457
Horror                        5815
                             ...
Comedy,Reality-TV,Romance        1
Crime,Family,Thriller            1
News,Reality-TV,Sport            1
Adult,Mystery                    1
Crime,Fantasy,Sci-Fi             1
Name: genres, Length: 1171, dtype: int64

In [268]:
# Create a filter for movies that are also documentaries
is_documentary = basics['genres'].str.contains('documentary', case = False)
is_documentary.value_counts()

False    147840
True      76093
Name: genres, dtype: int64

In [269]:
# Apply INVERSE of filter to df to remove all documentaries
basics = basics[~is_documentary]
basics.genres.value_counts()

Drama                        36110
Comedy                       13476
Comedy,Drama                  6457
Horror                        5815
Drama,Romance                 4317
                             ...
Family,Musical,Sport             1
Horror,Music,Mystery             1
Comedy,History,Mystery           1
Animation,Biography,Sport        1
Crime,Fantasy,Sci-Fi             1
Name: genres, Length: 954, dtype: int64

In [270]:
# Create new filter to verify no documentaries remain
is_documentary_v = basics['genres'].str.contains('documentary', case = False)
is_documentary_v.value_counts()

False    147840
Name: genres, dtype: int64

No documentaries remain in updated basics df

### Remove non-US Movies

in basics df using region information from akas df

In [271]:
# View current values for values in akas 'region' column
akas.region.value_counts()

DE    4366701
FR    4361926
JP    4360736
IN    4303353
ES    4281672
       ...
FM          2
TV          1
PW          1
NR          1
NU          1
Name: region, Length: 247, dtype: int64

In [272]:
# Count the total number of 'region' values of 'US'
print(f"Total value count for US:      {(akas['region'] == 'US').sum()}")
print(f"Total value count for non-US: {(akas['region'] != 'US').sum()}")

Total value count for US:      1448689
Total value count for non-US: 34976344

In [273]:
# Filter out all non-US movies
akas = akas[(akas['region'] == 'US')]

# Verify counts have been updated correctly
print(f"Total value count for US:     {(akas['region'] == 'US').sum()}")
print(f"Total value count for non-US: {(akas['region'] != 'US').sum()}")

Total value count for US:     1448689
Total value count for non-US: 0

All non-US movies have been removed from df akas. 

This filter now also needs to be applied to the df basics.

In [274]:
# Create additional filter in df basics to use US movie filter from df akas
keepers = basics['tconst'].isin(akas['titleId'])
keepers.value_counts()

True     86886
False    60954
Name: tconst, dtype: int64

In [275]:
# Apply 'keepers' filter to df basics
basics = basics[keepers]
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
42384,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
61115,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67667,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
86799,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [276]:
# Verify only US movies are now included in df basics
# Create a reverse filter between df akas and df basics
basics_US_filter = akas['titleId'].isin(basics['tconst'])

# Apply filter to akas and save to a copy of akas
akas2 = akas[basics_US_filter]

# Count US movies in filtered akas copy
akas2['region'].value_counts()

US    96669
Name: region, dtype: int64

Only US region movies appear to be included in df basics, now.

### Keep US Movies only

in akas df

In [277]:
# Use US movie filtered df akas2 to apply to main df akas
akas = akas2
akas['region'].value_counts()

US    96669
Name: region, dtype: int64

### Keep US Movies only

in ratings df

In [278]:
# Create additional filter in df ratings to use US movie filter from df akas
keepers_ratings = ratings['tconst'].isin(akas['titleId'])
keepers_ratings.value_counts()

False    1254127
True       71792
Name: tconst, dtype: int64

In [279]:
# Apply 'keepers' filter to df ratings
ratings = ratings[keepers_ratings]
ratings.head()

          tconst  averageRating  numVotes
17949  tt0035423            6.4     87019
24249  tt0043139            7.2       190
40738  tt0062336            6.4       175
46618  tt0069049            6.7      7731
63620  tt0088751            5.2       335

In [280]:
# Verify total count of df ratings matches True value from filter 'keepers_ratings'
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71792 entries, 17949 to 1325889
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71792 non-null  object
 1   averageRating  71792 non-null  float64
 2   numVotes       71792 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ MB

Only values in df ratings that remain are those that remain from non-US movies being filtered out of df akas.

The reason that df ratings has fewer entries than the filtered (US-only movies) in akas is because some of those US-only movies do not have an associated rating.

## Deliverable

In [282]:
# display info for each of the DataFrames
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 86886 entries, 34803 to 9974223
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86886 non-null  object
 1   titleType       86886 non-null  object
 2   primaryTitle    86886 non-null  object
 3   originalTitle   86886 non-null  object
 4   isAdult         86886 non-null  object
 5   startYear       86886 non-null  int64
 6   endYear         0 non-null      object
 7   runtimeMinutes  86886 non-null  object
 8   genres          86886 non-null  object
dtypes: int64(1), object(8)
memory usage: 6.6+ MB

In [283]:
# display info for each of the DataFrames
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71792 entries, 17949 to 1325889
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71792 non-null  object
 1   averageRating  71792 non-null  float64
 2   numVotes       71792 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ MB

In [284]:
# display info for each of the DataFrames
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 96669 entries, 201726 to 36424290
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   titleId          96669 non-null  object
 1   ordering         96669 non-null  int64
 2   title            96669 non-null  object
 3   region           96669 non-null  object
 4   language         945 non-null    object
 5   types            88996 non-null  object
 6   attributes       4361 non-null   object
 7   isOriginalTitle  96669 non-null  object
dtypes: int64(1), object(7)
memory usage: 6.6+ MB

In [286]:
# Save copy of processed DataFrames to local disk
basics.to_csv('Data/basics_final.csv.gz', compression = 'gzip', index=False)
ratings.to_csv('Data/ratings_final.csv.gz', compression = 'gzip', index=False)
akas.to_csv('Data/akas_final.csv.gz', compression = 'gzip', index=False)